---
kind: other
id: Properties.T:Autodesk.Revit.DB.SpacingRule
source: html/baa7ff3f-9227-9ddf-f77e-da4d8c8d6e39.htm
---
# SpacingRule Properties

On a curved surface, BeltMeasurement specifies where the
grid's distances are measured.